ab_report_NGINX
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking ruslan.com (be patient)


Server Software:        nginx/1.14.0
Server Hostname:        ruslan.com
Server Port:            80

Document Path:          /NGINX.png
Document Length:        43942 bytes

Concurrency Level:      4
Time taken for tests:   1.691 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      220935000 bytes
HTML transferred:       219710000 bytes
Requests per second:    2956.68 [#/sec] (mean)
Time per request:       1.353 [ms] (mean)
Time per request:       0.338 [ms] (mean, across all concurrent requests)
Transfer rate:          127584.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.7      0       5
Processing:     0    1   0.7      1       5
Waiting:        0    0   0.4      0       5
Total:          1    1   1.0      1       6
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      2
  90%      3
  95%      4
  98%      4
  99%      5
 100%      6 (longest request)